backend/app/Models/ContenidosModel.php

    public function getContenidosPorCurso(object $infoTable, bool $paginate = false){
      $baseUrl = base_url();
      $answer=$this->select("
          contenidos.id,
          contenidos.tema,
          CONCAT('$baseUrl','/Documents/',doc.url) AS url,
          contenidos.descripcion,
          contenidos.status,
          cd.id as idContenidoDocumento,
          doc.id as idDocumento,
      ")->join("curso","curso.id=contenidos.curso")
        ->join("contenidos_documentos cd","cd.contenido=contenidos.id")
        ->join("documentos doc","doc.id=cd.documento")
        ->where("curso.status","ACTIVO")
        ->where("curso.id",$infoTable->curso)
        ->where("curso.deleted_at is null")
        ->where('cd.deleted_at',null)
        ->where('doc.deleted_at',null)
        ->orderBy("contenidos.id","ASC");

      if($paginate){
          $answer = $answer->countAllResults();
---
SELECT `contenidos`.`id`, `contenidos`.`tema`, CONCAT('http://proyectos', '/Documents/', doc.url) AS url, `contenidos`.`descripcion`, `contenidos`.`status`, `cd`.`id` as `idContenidoDocumento`, `doc`.`id` as `idDocumento`
FROM `contenidos`
JOIN `curso` ON `curso`.`id`=`contenidos`.`curso`
JOIN `contenidos_documentos` `cd` ON `cd`.`contenido`=`contenidos`.`id`
JOIN `documentos` `doc` ON `doc`.`id`=`cd`.`documento`
WHERE `curso`.`status` = 'ACTIVO'
AND `curso`.`id` = '8'
AND `curso`.`deleted_at` is null
AND `cd`.`deleted_at` IS NULL
AND `doc`.`deleted_at` IS NULL
AND `contenidos`.`deleted_at` IS NULL
ORDER BY `contenidos`.`id` ASC
SELECT COUNT(*) AS `numrows`
FROM `contenidos`
JOIN `curso` ON `curso`.`id`=`contenidos`.`curso`
JOIN `contenidos_documentos` `cd` ON `cd`.`contenido`=`contenidos`.`id`
JOIN `documentos` `doc` ON `doc`.`id`=`cd`.`documento`
WHERE `curso`.`status` = 'ACTIVO'
AND `curso`.`id` = '8'
AND `curso`.`deleted_at` is null
AND `cd`.`deleted_at` IS NULL
AND `doc`.`deleted_at` IS NULL
AND `contenidos`.`deleted_at` IS NULL