backend/app/Models/InscripcionModel.php

    public function getInscripciones(object $infoTable, bool $paginate = false){
      $answer=$this->select("
          inscripcion.id,
          inscripcion.status,
          curso.nombre as cursoNombre,
          curso.id as curso,
          concat(p.nombres,' ',p.apellidos) as estudiante,
          p.identificacion,
          td.codigo as tipoId,
          user.id as usuario
      ")->join("curso","curso.id=inscripcion.curso")
        ->join("usuario as user","user.id=inscripcion.usuario")
        ->join("persona as p","p.id=user.persona")
        ->join("tipo_documento td","td.id=p.tipo_documento")
        ->where("curso.status","ACTIVO")
        ->where("p.status","ACTIVO")
        ->where("user.deleted_at is null")
        ->where("p.deleted_at is null")
        ->where("curso.deleted_at is null")
        ->orderBy("inscripcion.id","ASC");

      if($paginate){
          $answer = $answer->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `inscripcion`
JOIN `curso` ON `curso`.`id`=`inscripcion`.`curso`
JOIN `usuario` as `user` ON `user`.`id`=`inscripcion`.`usuario`
JOIN `persona` as `p` ON `p`.`id`=`user`.`persona`
JOIN `tipo_documento` `td` ON `td`.`id`=`p`.`tipo_documento`
WHERE `curso`.`status` = 'ACTIVO'
AND `p`.`status` = 'ACTIVO'
AND `user`.`deleted_at` is null
AND `p`.`deleted_at` is null
AND `curso`.`deleted_at` is null
AND `inscripcion`.`deleted_at` IS NULL

    public function getCursos(object $infoTable, bool $paginate = false){
      $answer=$this->select("
          curso.nombre,
          curso.id,
          curso.descripcion
      ")->join("curso","curso.id=inscripcion.curso")
        ->join("usuario as user","user.id=inscripcion.usuario")
        ->join("persona as p","p.id=user.persona")
        ->where("curso.status","ACTIVO")
        ->where("p.status","ACTIVO")
        ->where("user.deleted_at is null")
        ->where("p.deleted_at is null")
        ->where("curso.deleted_at is null")
        ->where("p.id",$infoTable->idPersona)
        ->orderBy("curso.nombre","ASC");

      if($paginate){
          $answer = $answer->countAllResults();
---
SELECT `curso`.`nombre`, `curso`.`id`, `curso`.`descripcion`
FROM `inscripcion`
JOIN `curso` ON `curso`.`id`=`inscripcion`.`curso`
JOIN `usuario` as `user` ON `user`.`id`=`inscripcion`.`usuario`
JOIN `persona` as `p` ON `p`.`id`=`user`.`persona`
WHERE `curso`.`status` = 'ACTIVO'
AND `p`.`status` = 'ACTIVO'
AND `user`.`deleted_at` is null
AND `p`.`deleted_at` is null
AND `curso`.`deleted_at` is null
AND `p`.`id` = '2'
AND `inscripcion`.`deleted_at` IS NULL
ORDER BY `curso`.`nombre` ASC
SELECT COUNT(*) AS `numrows`
FROM `inscripcion`
JOIN `curso` ON `curso`.`id`=`inscripcion`.`curso`
JOIN `usuario` as `user` ON `user`.`id`=`inscripcion`.`usuario`
JOIN `persona` as `p` ON `p`.`id`=`user`.`persona`
WHERE `curso`.`status` = 'ACTIVO'
AND `p`.`status` = 'ACTIVO'
AND `user`.`deleted_at` is null
AND `p`.`deleted_at` is null
AND `curso`.`deleted_at` is null
AND `p`.`id` = '2'
AND `inscripcion`.`deleted_at` IS NULL