backend/app/Models/PersonaModel.php

   public function getStudents(object $infoTable, bool $paginate = false){
    $answer=$this->select("
        persona.id,
        persona.tipo_documento,
        persona.identificacion,
        persona.nombres,
        persona.apellidos,
        persona.celular,
        td.codigo as tipoId,
        td.id as idTipo,
        p.nombre as nombrePrograma,
        p.id as programa,
        user.status
    ");
    $answer=$answer->join("usuario AS user","user.persona=persona.id")
                   ->join("tipo_documento td","td.id=persona.tipo_documento")
                   ->join("programa p","p.id=persona.programa")
                   ->join("rol","rol.id=user.rol")
                   ->where("rol.nombre","ESTUDIANTE")
                   ->where("user.status","ACTIVO")
                   ->where("rol.status","ACTIVO");
    if($paginate){
        $answer = $answer->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `persona`
JOIN `usuario` AS `user` ON `user`.`persona`=`persona`.`id`
JOIN `tipo_documento` `td` ON `td`.`id`=`persona`.`tipo_documento`
JOIN `programa` `p` ON `p`.`id`=`persona`.`programa`
JOIN `rol` ON `rol`.`id`=`user`.`rol`
WHERE `rol`.`nombre` = 'ESTUDIANTE'
AND `user`.`status` = 'ACTIVO'
AND `rol`.`status` = 'ACTIVO'
AND `persona`.`deleted_at` IS NULL