backend/app/Models/ProgramasModel.php

SELECT COUNT(*) AS `numrows`
FROM `programa`
WHERE `programa`.`deleted_at` IS NULL
---
   public function getPrograms(object $infoTable, bool $paginate = false){
    $answer=$this->select("
        programa.id,
        programa.nombre,
        programa.status
    ");

    if($paginate){
        $answer = $answer->countAllResults();