backend/app/Models/UsuarioModel.php

SELECT `rol`.`nombre`
FROM `usuario`
JOIN `rol` ON `rol`.`id`=`usuario`.`rol`
WHERE `usuario`.`username` = 'admin'
AND `rol`.`status` = 'ACTIVO'
AND `usuario`.`deleted_at` IS NULL
 LIMIT 1
---
    public function obtenerSession($data){

      $rol=$this->select('rol.nombre')
                ->join('rol','rol.id=usuario.rol')
                ->where('usuario.username', $data)
                ->where('rol.status','ACTIVO')
                ->first();

SELECT COUNT(*) AS `numrows`
FROM `usuario`
JOIN `persona` `p` ON `usuario`.`persona`=`p`.`id`
JOIN `rol` `ro` ON `usuario`.`rol`=`ro`.`id`
WHERE `usuario`.`deleted_at` is null
AND `ro`.`nombre` = 'ESTUDIANTE'
AND `p`.`deleted_at` is null
AND `usuario`.`status` = 'ACTIVO'
AND `p`.`status` = 'ACTIVO'
AND `usuario`.`deleted_at` IS NULL
---
    public function getUsuarios(object $infoTable,bool $op=false){
      $respuesta=$this->select('usuario.id,
                                usuario.correo,
                                usuario.status,
                                usuario.rol,
                                usuario.username,
                                p.tipo_documento,
                                p.identificacion,
                                p.id as persona,
                                CONCAT(p.nombres," ",p.apellidos) as nombre'
                              )
                      ->join('persona p','usuario.persona=p.id')
                      ->join('rol ro','usuario.rol=ro.id')
                      ->where('usuario.deleted_at is null')
                      ->where('ro.nombre','ESTUDIANTE')
                      ->where('p.deleted_at is null')
                      ->where('usuario.status','ACTIVO')
                      ->Where('p.status','ACTIVO');
        $respuesta=$respuesta->orderBy('usuario.id','ASC');
      //SECCION DE EJECUCION DE CONSULTA
      if($op){
        $respuesta=$respuesta->countAllResults();

SELECT `usuario`.`id`, `usuario`.`persona`, `usuario`.`username`, `usuario`.`password`, `usuario`.`correo`, `usuario`.`rol`, `usuario`.`status`
FROM `usuario`
JOIN `persona` `p` ON `p`.`id`=`usuario`.`persona`
WHERE `p`.`identificacion` = '1098756772'
AND `usuario`.`status` = 'ACTIVO'
AND `usuario`.`deleted_at` IS NULL
 LIMIT 1
---
    public function findUsuarioByIdentificacion(object $infoTable){
      $answer=$this->select("
            usuario.id,
            usuario.persona,
            usuario.username,
            usuario.password,
            usuario.correo,
            usuario.rol,
            usuario.status")
            ->join('persona p','p.id=usuario.persona')
            ->where("p.identificacion",$infoTable->identificacion)
            ->where("usuario.status","ACTIVO");